importPackage(Packages.server);

보라 = "#fMap/MapHelper.img/weather/starPlanet/7#";
파랑 = "#fMap/MapHelper.img/weather/starPlanet/8#";
별파 = "#fUI/GuildMark.img/Mark/Pattern/00004001/11#"
별노 = "#fUI/GuildMark.img/Mark/Pattern/00004001/3#"
별흰 = "#fUI/GuildMark.img/Mark/Pattern/00004001/15#"
별갈 = "#fUI/GuildMark.img/Mark/Pattern/00004001/5#"
별빨 = "#fUI/GuildMark.img/Mark/Pattern/00004001/1#"
별검 = "#fUI/GuildMark.img/Mark/Pattern/00004001/16#"
별보 = "#fUI/GuildMark.img/Mark/Pattern/00004001/13#"
별 = "#fUI/FarmUI.img/objectStatus/star/whole#"
S = "#fUI/CashShop.img/CSEffect/today/0#"
보상 = "#fUI/UIWindow2.img/Quest/quest_info/summary_icon/reward#"
획득 = "#fUI/UIWindow2.img/QuestIcon/4/0#"
색 = "#fc0xFF6600CC#"
검은색 = "#fc0xFF000000#"
핑크색 ="#fc0xFFFF3366#"
분홍색 = "#fc0xFFF781D8#"
엔터 = "\r\n"
엔터2 = "\r\n\r\n"

var enter = "\r\n";
var seld = -1;

var need = 4021031, qty = 100;
var 선택필요 = 4021031, 선택개수 = 300;

var range = 1; // 한줄에 몇개?

var dskin = [2438159, 2438871, 2435516, 2431966, 2431967, 2432131, 2438163, 2438164, 2438165, 2438166, 2438167, 2438168, 2438169, 2438170, 2438171, 2438172, 2438173, 2438174, 2438175, 2438176, 2438177, 2438179, 2438178, 2438180, 2438181, 2438182, 2438184, 2438185, 2438186, 2438187, 2438188, 2438189, 2438190, 2438191, 2438192, 2438193, 2438195, 2438196, 2438197, 2438201, 2438198, 2438199, 2438200, 2438202, 2438203, 2438204, 2438205, 2438206, 2438207, 2438208, 2438209, 2438210, 2438211, 2438212, 2438213, 2438214, 2438215, 2438216, 2438217, 2438218, 2438219, 2438220, 2438221, 2438222, 2438223, 2438224, 2438225, 2438226, 2438227, 2438228, 2438229, 2438230, 2438231, 2438232, 2438233, 2438234, 2438235, 2438236, 2438237, 2438238, 2438239, 2438240, 2438241, 2438242, 2438243, 2438244, 2438245, 2438246, 2438247, 2438248, 2438249, 2438250, 2438251, 2438252, 2438253, 2438254, 2438255, 2438256, 2438257, 2438258, 2438259, 2438260, 2438261, 2438262, 2438263, 2438264, 2438265, 2438266, 2438267, 2438268, 2438269, 2438270, 2438271, 2438272, 2438273, 2438274, 2438275, 2438276, 2438277, 2438278, 2438279, 2438280, 2438281, 2438282, 2438283, 2438284, 2438285, 2438286, 2438287, 2438288, 2438289, 2438290, 2438291, 2438292, 2438293, 2438294, 2438295, 2438296, 2438297, 2438298, 2438299, 2438300, 2438301, 2438302, 2438303, 2438304, 2438305, 2438306, 2438307, 2438308, 2438309, 2438310, 2438311, 2438312, 2438313, 2438314, 2438315, 2438353, 2438378, 2438379, 2438413, 2438415, 2438417, 2438419, 2438485, 2438492, 2438530, 2438637, 2438672, 2438713, 2438881, 2438885, 2439298, 2439336, 2439337, 2439338, 2439381, 2439393, 2439395, 2439408, 2439572, 2439617, 2439652, 2439684, 2439686, 2439769, 2439925, 2439927, 2630137, 2630222, 2630178, 2630214, 2630380, 2630235, 2630224, 2630262, 2630264, 2630266, 2630385, 2630400, 2630434, 2630436, 2439397, 2439399, 2630268, 2439682, 2439401, 2438149, 2438151, 2630477, 2630479, 2630481, 2630483, 2630485, 2630516, 2630552, 2630554, 2630556, 2630558, 2630560, 2630652, 2630743, 2630745, 2630747, 2630749, 2630751, 2630753, 2630804, 2630969, 2631094, 2631095, 2631098, 2631135, 2631189, 2631183, 2631401, 2631451, 2631471, 2631492, 2631610, 2438147, 2631892, 2631893, 2631884, 2631885, 2631815, 2631798, 2632124, 2632281, 2632288, 2632350, 2632430, 2632544, 2632498, 2632712, 2632816, 5680862, 2632888, 2632976, 2633045, 2633047, 2633074, 2633218, 2633220, 2633306, 2633313, 2633599, 2438872, 2633995, 2634020, 2631097, 2634176, 2634251, 2634259, 2634268, 2634277, 2634279, 2634416, 2634513 , 2634640 , 2634728 , 2634811 , 2634906 , 2634941, 2633557, 2633573, 2633700, 2635056, 2635128, 2635233, 2635408, 2635469, 5681000, 5681001, 2635516, 2635535, 2635529, 2635633, 2635689, 2635794, 2635782, 2635914, 2635968, 2635970, 2635996, 2635966, 2635972, 2636151];


function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, sel) {
    if (mode == 1) {
        status++;
    } else {
        cm.dispose();
        return;
    }
    
    if (status == 0) {
        var msg = "#fs11#" + enter;
        msg += "#fc0xFF000000#각종 데미지스킨들이 준비되어 있는 것 같다.#b" + enter;
        msg += "랜덤 - #i" + need + "##z" + need + "# " + qty + "개" + enter;
        //msg += "선택 - #i"+선택필요+"##z"+선택필요+"# "+선택개수+"개#b"+enter;
        msg += "#L1##d아이템 목록을 확인해본다." + enter;
        msg += "#L2#랜덤으로 뽑아볼래\r\n";
        //msg += "#L3#선택으로 뽑아볼래";

        cm.sendSimple(msg);
    } else if (status == 1) {
        switch (sel) {
            case 1:
                var msg = "#fs11#" +enter;
                for (i = 0; i < dskin.length; i++) {
                    if (i % range == 0) {
                        msg += "\r\n#b"
                    }
                    msg += "#i" + dskin[i] + "##z" + dskin[i] + "#";
                }
                cm.sendOk(msg);
                cm.dispose();
                break;
            case 2:
                if (!cm.haveItem(need, qty)) {
                    cm.sendOk("#fs11#뽑기에 필요한 재료가 부족합니다.");
                    cm.dispose();
                    return;
                }
                a = Packages.objects.utils.Randomizer.rand(0, (dskin.length - 1));

                if (!cm.canHold(dskin[a], 1)) {
                    cm.sendOk("#fs11#인벤토리 공간이 부족합니다.");
                    cm.dispose();
                    return;
                }

                cm.gainItem(need, -qty);
                cm.gainItem(dskin[a], 1);
                msg = "#fs11#다음과 같은 아이템이 나왔다." + enter;
                msg += "#fs11##b" + enter + "#i" + dskin[a] + "##z" + dskin[a] + "#";
                msg += 핑크색 + "\r\n\r\n한번더 뽑으시겠습니까?";
                cm.sendYesNo(msg);
                break;
            case 3:
                var msg = "#fs11#원하는 데미지스킨를 선택해보자. #fs11##b"
                for (i = 0; i < dskin.length; i++) {
                    if (i % range == 0) {
                        msg += "\r\n"
                    }
                    msg += "#L" + i + "##i" + dskin[i] + "##z" + dskin[i] + "#";
                }
                cm.sendSimple(msg);
                break;
        }
    } else if (status == 2) {
        a = sel;

        if (a == -1) { // 한번더 뽑기[랜덤]
            status = 0;
            action(1, 0, 2);
            return;
        }

        if (!cm.haveItem(선택필요, 선택개수)) {
            cm.sendOk("#fs11#뽑기에 필요한 재료가 부족합니다.");
            cm.dispose();
            return;
        }

        if (!cm.canHold(dskin[a], 1)) {
            cm.sendOk("#fs11#인벤토리 공간이 부족합니다.");
            cm.dispose();
            return;
        }

        cm.gainItem(선택필요, -선택개수);
        cm.gainItem(dskin[a], 1);
        cm.sendOk("#fs11#다음과 같은 아이템이 나왔다.\r\n#b" + enter + "#i" + dskin[a] + "##z" + dskin[a] + "#");
        cm.dispose();
    }
}