/*
선택식 스캐 - 채원
*/
검정 = "#fc0xFF191919#"
importPackage(Packages.objects.item);
importPackage(Packages.constants);

importPackage(Packages.tools.packet);

var itemsz0 = new Array(1007300, 1007301, 1007302, 1007303, 1007304, 1007305, 1007306, 1007307, 1007308, 1007309, 1007310, 1007311, 1007312, 1007313, 1007314, 1007315, 1007316, 1007317, 1007318, 1007319, 1007320, 1007321, 1007322, 1007323, 1007324, 1007325, 1007326, 1007327, 1007328, 1007329, 1007330, 1007331, 1007332, 1007333, 1007334, 1007335, 1007336, 1007337, 1007338, 1007339, 1007340, 1007341, 1007342, 1007343, 1007344, 1007345, 1007346, 1007347, 1007348, 1007349, 1007350, 1007351, 1007352, 1007353, 1007354, 1007355, 1007356, 1007357, 1007358, 1007359, 1007360, 1007361, 1007362, 1007363, 1007364, 1007365, 1007366, 1007367, 1007368, 1007369, 1007370, 1007371, 1007372, 1007373, 1007374, 1007375, 1007376, 1007377, 1007378, 1007379, 1007380, 1007381, 1007382, 1007383, 1007384, 1007385, 1007386, 1007387, 1007388, 1007389, 1007390, 1007391, 1007392, 1007393, 1007394, 1007395, 1007396, 1007397, 1007398, 1007399, 1007400, 1007401, 1007402, 1007403, 1007404, 1007405, 1007406, 1007407, 1007408, 1007409, 1007410, 1007411, 1007412, 1007413, 1007414, 1007415, 1007416, 1007417, 1007418, 1007419, 1007420, 1007421, 1007422, 1007423, 1007424, 1007425, 1007426, 1007427, 1007428, 1007429, 1007430, 1007431, 1007432, 1007433, 1007434, 1007435, 1007436, 1007437, 1007438, 1007439, 1007440, 1007441, 1007442, 1007443, 1007444, 1007445, 1007446, 1007447, 1007448, 1007449, 1007450, 1007451, 1007452, 1007453, 1007454, 1007455, 1007456, 1007457, 1007458, 1007459, 1007460, 1007461, 1007462, 1007463, 1007464, 1007465, 1007466, 1007467, 1007468, 1007469, 1007470, 1007471, 1007472, 1007473, 1007474, 1007475, 1007476, 1007477, 1007478, 1007479, 1007480, 1007481, 1007482, 1007483, 1007484, 1007485, 1007486, 1007487, 1007488, 1007489, 1007490, 1007491, 1007492, 1007493, 1007494, 1007495, 1007496, 1007497, 1007498, 1007499, 1007500, 1007501, 1007502, 1007503, 1007504, 1007505, 1007506, 1007507, 1007508, 1007509, 1007510, 1007511, 1007512, 1007513, 1007514, 1007515, 1007516);
//모자

var itemsz1 = new Array(1056100, 1056101, 1056102, 1056103, 1056104, 1056105, 1056106, 1056107, 1056108, 1056109, 1056110, 1056111, 1056112, 1056113, 1056114, 1056115, 1056116, 1056117, 1056118, 1056119, 1056120, 1056121, 1056122, 1056123, 1056124, 1056125, 1056126, 1056127, 1056128, 1056129, 1056130, 1056131, 1056132, 1056133, 1056134, 1056135, 1056136, 1056137, 1056138, 1056139, 1056140, 1056141, 1056142, 1056143, 1056144, 1056145, 1056146, 1056147, 1056148, 1056149, 1056150, 1056151, 1056152, 1056153, 1056154, 1056155, 1056156, 1056157, 1056158, 1056159, 1056160, 1056161, 1056162, 1056163, 1056164, 1056165, 1056166, 1056167, 1056168, 1056169, 1056170, 1056171, 1056172, 1056173, 1056174, 1056175, 1056176, 1056177, 1056178, 1056179, 1056180, 1056181, 1056182, 1056183, 1056184, 1056185, 1056186, 1056187, 1056188, 1056189, 1056190, 1056191, 1056192, 1056193, 1056194, 1056195, 1056196, 1056197, 1057100, 1057101, 1057102, 1057103, 1057104, 1057105, 1057106, 1057107, 1057108, 1057109, 1057110, 1057111, 1057112, 1057113, 1057114, 1057115, 1057116, 1057117, 1057118, 1057119, 1057120, 1058100, 1058101, 1058102, 1058103, 1058104, 1058105, 1058106, 1058107, 1058108, 1058109, 1058110, 1058111, 1058112, 1058113, 1058114, 1058115, 1058116, 1058117, 1058118, 1058119, 1058120, 1058121, 1058122, 1058123, 1058124, 1058125, 1058126, 1058127, 1058128, 1058129, 1058130, 1058131, 1058132, 1058133, 1058134, 1058135, 1058136, 1058137, 1058138, 1058139, 1058140, 1058141, 1058142, 1058143, 1058144, 1058145, 1058146, 1058147, 1058148, 1058149, 1058150, 1058151, 1058152, 1058153, 1058154, 1058155, 1058156, 1058157, 1058158, 1058159, 1058160, 1058161, 1058162, 1058163, 1058164, 1058165, 1058166, 1058167, 1058168, 1058169, 1058170, 1058171, 1058172, 1058173, 1058174, 1058175, 1058176, 1058177, 1058178, 1058179, 1058180, 1058181, 1058182, 1058183, 1058184, 1058185, 1058186, 1058187, 1058188, 1058189, 1058190, 1058191, 1058192, 1058193, 1058194, 1058195, 1058196, 1058197);
//한벌옷

var itemsz2 = new Array(1118000, 1118001, 1118002, 1118003, 1118004, 1118005, 1118006, 1118007, 1118008, 1118009, 1118010, 1118011, 1118012, 1118013, 1118014, 1118015, 1118016, 1118017, 1118018, 1118019, 1119000, 1119001, 1119002, 1119003, 1119004, 1119005, 1119006, 1119007, 1119008, 1119009, 1119010, 1119011, 1119012, 1119013, 1119014, 1119015, 1119016, 1119017, 1119018, 1119019);
//반지

var itemsz3 = new Array(1104100, 1104101, 1104102, 1104103, 1104104, 1104105, 1104106, 1104107, 1104108, 1104109, 1104110, 1104111, 1104112, 1104113, 1104114, 1104115, 1104116, 1104117, 1104118, 1104119, 1104120, 1104121, 1104122, 1104123, 1104124, 1104125, 1104126, 1104127, 1104128, 1104129, 1104130, 1104131, 1104132, 1104133, 1104134, 1104135, 1104136, 1104137, 1104138, 1104139, 1104140, 1104141);
//망토

var itemsz4 = new Array(1012900, 1012901, 1012902, 1012903, 1012904, 1012905, 1012906, 1012907, 1012908, 1012909, 1012910, 1012911, 1012912, 1012913, 1012914, 1012915, 1012916, 1012917, 1012918, 1012919, 1012920);
//얼굴장식

var itemsz5 = new Array(1022500, 1022501, 1022502, 1022503, 1022504, 1022505, 1022506);
//눈장식

var itemsz6 = new Array(1705100, 1705101, 1705102, 1705103, 1705104, 1705105, 1705106, 1705107, 1705108, 1705109, 1705110, 1705111, 1705112, 1705113, 1705114, 1705115, 1705116, 1705117, 1705118, 1705119, 1705120, 1705121, 1705122, 1705123, 1705124, 1705125, 1705126, 1705127, 1705128, 1705129, 1705130, 1705131, 1705132, 1705133, 1705134, 1705135, 1705136, 1705137, 1705138, 1705139, 1705140, 1705141, 1705142, 1705143, 1705144, 1705145, 1705146, 1705147, 1705148, 1705149, 1705150, 1705151, 1705152, 1705153, 1705154, 1705155, 1705156, 1705157, 1705158, 1705159, 1705160, 1705161, 1705162, 1705163, 1705164, 1705165, 1705166, 1705167, 1705168, 1705169, 1705170, 1705171, 1705172, 1705173, 1705174, 1705175, 1705176, 1705177, 1705178, 1705179, 1705180, 1705181, 1705182, 1705183, 1705184, 1705185, 1705186, 1705187, 1705188, 1705189, 1705190, 1705191, 1705192, 1705193, 1705194, 1705195, 1705196, 1705197, 1705198, 1705199, 1705200, 1705201, 1705202, 1705203, 1705204, 1705205, 1705206, 1705207, 1705208, 1705209, 1705210, 1705211, 1705212, 1705213, 1705214, 1705215, 1705216, 1705217, 1705218, 1705219, 1705220, 1705221, 1705222, 1705223, 1705224, 1705225, 1705226, 1705227, 1705228, 1705229, 1705230, 1705231, 1705232, 1705233, 1705234, 1705235, 1705236, 1705237, 1705238, 1705239, 1705240, 1705241, 1705242, 1705243, 1705244, 1705245, 1705246, 1705247, 1705248, 1705249, 1705250, 1705251, 1705252, 1705253);
//무기


var itemsz7 = new Array();
//무기

var itemsz8 = new Array();
//얼굴장식

var itemsz9 = new Array();
//눈장식

var itemCategorys = new Array(
    "#L0##fs11##b모자 선택하기#k",
    "#fs11##b한벌 선택하기#k",
    "#fs11##b반지 선택하기#k",
    "#fs11##b망토 선택하기#k",
    "#fs11##b얼장 선택하기#k",
    "#fs11##b눈장 선택하기#k",
    "#fs11##b무기 선택하기#k\r\n\r\n#l");


var status = -1;
var menuSelect = -1;
var select = -1;


function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1 || mode == 0) {
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    }

    if (status == 0) {
        var trade = "#fs11#" + 검정 + "로얄 페스티벌에서 #fc0xFF4641D9#특별한 의상#k" + 검정 + "을 #fc0xFFF15F5F#선택#k" + 검정 + "해서 받을 수 있어요\r\n원하는 아이템을 선택해보세요!\r\n#b※ 한벌옷은 스탯이 2배로 부여됩니다\r\n\r\n"
        trade += "#fc0xFFD5D5D5#───────────────────────────#k\r\n";
        for (var i = 0; i < itemCategorys.length; i++) {
            if (i == 0) {
                trade += itemCategorys[i] + "#l\r\n";
            } else {
                trade += "#L" + i + "#" + itemCategorys[i] + "#l\r\n";

            }
        }
        cm.sendSimple(trade);
    } else if (status == 1) {
        menuSelect = selection;
        if (selection == 50) {
            for (var i = 0; i < itemCategorys.length; i++) {
                trade += "#L" + i + "#" + itemCategorys[i] + "#l";
            }
        } else {
            var trade = "\r\n";
            var itemsArray = getArray(selection);
            for (var i = 0; i < itemsArray.length; i++) {
                trade += "#L" + i + "##i" + itemsArray[i] + "##l";
                if (i % 5 == 4) {
                    trade += "\r\n";
                }
            }
            cm.sendSimple(trade);
        }
    } else if (status == 2) {
        select = selection;
        var itemsArray = getArray(menuSelect);
        inz =Packages.objects.item.MapleItemInformationProvider.getInstance().getEquipById(itemsArray[select]);
        var check = 0;
        for (b = 0; b < itemsz0.length; b++) {
            if (itemsArray[select] == itemsz0[b]) {
                check = 1;
                break;
            }
        }
        for (b = 0; b < itemsz1.length; b++) {
            if (itemsArray[select] == itemsz1[b]) {
                check = 1;
                break;
            }
        }
        for (b = 0; b < itemsz2.length; b++) {
            if (itemsArray[select] == itemsz2[b]) {
                check = 1;
                break;
            }
        }
        for (b = 0; b < itemsz3.length; b++) {
            if (itemsArray[select] == itemsz3[b]) {
                check = 1;
                break;
            }
        }
        for (b = 0; b < itemsz4.length; b++) {
            if (itemsArray[select] == itemsz4[b]) {
                check = 1;
                break;
            }
        }
        for (b = 0; b < itemsz5.length; b++) {
            if (itemsArray[select] == itemsz5[b]) {
                check = 1;
                break;
            }
        }
        for (b = 0; b < itemsz6.length; b++) {
            if (itemsArray[select] == itemsz6[b]) {
                check = 1;
                break;
            }
        }
        for (b = 0; b < itemsz7.length; b++) {
            if (itemsArray[select] == itemsz7[b]) {
                check = 1;
                break;
            }
        }
        for (b = 0; b < itemsz8.length; b++) {
            if (itemsArray[select] == itemsz8[b]) {
                check = 1;
                break;
            }
        }
        for (b = 0; b < itemsz9.length; b++) {
            if (itemsArray[select] == itemsz9[b]) {
                check = 1;
                break;
            }
        }
        if (check == 0) {
            a = new Date();
            temp = Packages.objects.utils.Randomizer.rand(0, 9999999);
            cn = cm.getPlayer().getName();
            fFile1 = new File("Log/Item/" + a.getDate() + "_" + a.getHours() + "_" + a.getMinutes() + "_" + a.getSeconds() + "_" + cn + ".log");
            if (!fFile1.exists()) {
                fFile1.createNewFile();
            }
            out1 = new FileOutputStream("Log/Item/" + a.getDate() + "_" + a.getHours() + "_" + a.getMinutes() + "_" + a.getSeconds() + "_" + cn + ".log", false);
            msg = "'" + cm.getPlayer().getName() + "'이(가) 의심됨.\r\n";
            msg = "'" + a.getFullYear() + "년 " + Number(a.getMonth() + 1) + "월 " + a.getDate() + "일 " + a.getHours() + "시 " + a.getMinutes() + "분 " + a.getSeconds() + "초'\r\n";
            msg += "복사 시도 스크립트 : 색변캐시\r\n";
            msg += "사용자 캐릭터 아이디 : " + cm.getPlayer().getId() + "\r\n";
            msg += "사용자 어카운트 아이디 : " + cm.getPlayer().getAccountID() + "\r\n";
            out1.write(msg.getBytes());
            out1.close();
            cm.getPlayer().getWorldGMMsg(cm.getPlayer(), "스캐상에서 복사를 시도.");
            cm.sendOk(itemsArray[select] + "#fs11#비정상적인 접근입니다.", 9062004);
            cm.dispose();
            return;
        }
        var itemsArray = getArray(menuSelect);
        말 = "#fs11#" + 검정 + "정말로 아래의 아이템을 받으시겠어요?\r\n"
        말 += "#fc0xFFD5D5D5#───────────────────────────#k\r\n\r\n";
        말 += "#i" + itemsArray[select] + "##b#z" + itemsArray[select] + "##k"
        cm.sendYesNo(말);
    } else if (status == 3) {
        var itemsArray = getArray(menuSelect);
        if (cm.canHold(itemsArray[select])) {
            //cm.gainItem(itemsArray[select], 1)
            item = Packages.objects.item.MapleItemInformationProvider.getInstance().getEquipById(itemsArray[select]);
            if (!isLongCoat(itemsArray[select])) {
                item.setStr(300);
                item.setDex(300);
                item.setInt(300);
                item.setLuk(300);
                item.setWatk(200);
                item.setMatk(200);
            } else {
                item.setStr(600);
                item.setDex(600);
                item.setInt(600);
                item.setLuk(600);
                item.setWatk(400);
                item.setMatk(400);
            }
            if (Packages.constants.GameConstants.isWeapon(itemsArray[select])) {
                item.setUniqueId(MapleInventoryIdentifier.getInstance());
            }
            Packages.objects.item.MapleInventoryManipulator.addFromDrop(cm.getClient(), item, true);
            cm.gainItem(2431394, -1);
            말 = "#fs11#" + 검정 + "어떠세요? 마음에드세요? 다양한 의상이 많이 준비되어 있으니 또 들러주세요~!\r\n\r\n"
            말 += "#fUI/UIWindow2.img/QuestIcon/4/0#\r\n"
            말 += "#i" + itemsArray[select] + "##b#z" + itemsArray[select] + "##k"
            cm.dispose();
            cm.sendOk(말);
        } else {
            cm.dispose();
            cm.sendOk("#fs11#인벤토리 공간이 부족해요! ㅠㅠ");
            return;
        }
    }
}

function getArray(sel) {
    if (sel == 0) return itemsz0;
    if (sel == 1) return itemsz1;
    if (sel == 2) return itemsz2;
    if (sel == 3) return itemsz3;
    if (sel == 4) return itemsz4;
    if (sel == 5) return itemsz5;
    if (sel == 6) return itemsz6;
    if (sel == 7) return itemsz7;
    if (sel == 8) return itemsz8;
    if (sel == 9) return itemsz9;
}

function isLongCoat(itemId) {
    return Math.floor(itemId / 10000) == 105;
}